In [1]:
import pandas as pd
import numpy as np

In [2]:
url='https://raw.githubusercontent.com/BigDataGal/Python-for-Data-Science/master/titanic-train.csv'

In [3]:
df = pd.read_csv(url)

In [4]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
df.Survived.value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [6]:
df.Sex.value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [7]:
df.Embarked.value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [8]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [9]:
df_train = df.drop(["PassengerId","Cabin","Name","Ticket"], axis =1)

In [10]:
df_train.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [11]:
df_train.shape

(891, 8)

In [12]:
177/891

0.19865319865319866

In [13]:
df_train.isna().sum()

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Fare          0
Embarked      2
dtype: int64

In [14]:
df_train.groupby(["Pclass"]).mean()

        Survived        Age     SibSp     Parch       Fare
Pclass
1       0.629630  38.233441  0.416667  0.356481  84.154687
2       0.472826  29.877630  0.402174  0.380435  20.662183
3       0.242363  25.140620  0.615071  0.393075  13.675550

In [15]:
df_train.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [16]:
def remove_null(col):
    pclass = int(col[0])
    age = col[1]
    #print( pclass, age)
    
    if pd.isnull(age):
        #print("replpace with new")
        if pclass ==1:
            return 38
        elif pclass==2:
            return 28
        else:
            return 25
    else:
        return age

In [21]:
df_train["Age"]=df_train[['Pclass','Age']].apply(remove_null, axis = 1)

In [18]:
df_train.isna().sum()

Survived    0
Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    2
dtype: int64

In [22]:
df_train.dropna(inplace=True)

In [24]:
df_train.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [25]:
df_dummied = pd.get_dummies(df_train, columns= ['Sex',"Embarked"] )

In [50]:
###df_dummied = pd.get_dummies(df_dummied, columns= ['Embarked'] )

In [26]:
df_dummied

,Survived,Pclass,Age,SibSp,Parch,Fare,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S
0,0,3,22.0,1,0,7.2500,0,1,0,0,1
1,1,1,38.0,1,0,71.2833,1,0,1,0,0
2,1,3,26.0,0,0,7.9250,1,0,0,0,1
3,1,1,35.0,1,0,53.1000,1,0,0,0,1
4,0,3,35.0,0,0,8.0500,0,1,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,27.0,0,0,13.0000,0,1,0,0,1
887,1,1,19.0,0,0,30.0000,1,0,0,0,1
888,0,3,25.0,1,2,23.4500,1,0,0,0,1
889,1,1,26.0,0,0,30.0000,0,1,1,0,0
890,0,3,32.0,0,0,7.7500,0,1,0,1,0

In [28]:
col_list = ['Pclass','Age','SibSp','Parch','Fare','Sex_female','Sex_male','Embarked_C','Embarked_Q','Embarked_S']

In [70]:
df_dummied.head()

,Survived,Pclass,Age,SibSp,Parch,Fare,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S
0,0,3,22.0,1,0,7.2500,0,1,0,0,1
1,1,1,38.0,1,0,71.2833,1,0,1,0,0
2,1,3,26.0,0,0,7.9250,1,0,0,0,1
3,1,1,35.0,1,0,53.1000,1,0,0,0,1
4,0,3,35.0,0,0,8.0500,0,1,0,0,1

In [71]:
df_dummied.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 889 entries, 0 to 890
Data columns (total 11 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Survived    889 non-null    int64
 1   Pclass      889 non-null    int64
 2   Age         889 non-null    float64
 3   SibSp       889 non-null    int64
 4   Parch       889 non-null    int64
 5   Fare        889 non-null    float64
 6   Sex_female  889 non-null    uint8
 7   Sex_male    889 non-null    uint8
 8   Embarked_C  889 non-null    uint8
 9   Embarked_Q  889 non-null    uint8
 10  Embarked_S  889 non-null    uint8
dtypes: float64(2), int64(4), uint8(5)
memory usage: 53.0 KB

In [29]:
X=df_dummied[col_list]
y=df_dummied['Survived']

In [30]:
type(X)

pandas.core.frame.DataFrame

In [31]:
type(y)

pandas.core.series.Series

In [32]:
from sklearn.model_selection import train_test_split

In [33]:
X_train, X_test, y_train, y_test=train_test_split(X,y,test_size = 0.3, random_state = 11)

In [34]:
X_train.shape

(622, 10)

In [35]:
X_test.shape

(267, 10)

In [36]:
y_train.shape

(622,)

In [37]:
from sklearn.linear_model import LogisticRegression

In [81]:
lor = LogisticRegression(C=5.0, max_iter=1000 )

In [82]:
lor.fit(X_train,y_train)

LogisticRegression(C=5.0, max_iter=1000)

In [83]:
df_dummied.head()

,Survived,Pclass,Age,SibSp,Parch,Fare,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S
0,0,3,22.0,1,0,7.2500,0,1,0,0,1
1,1,1,38.0,1,0,71.2833,1,0,1,0,0
2,1,3,26.0,0,0,7.9250,1,0,0,0,1
3,1,1,35.0,1,0,53.1000,1,0,0,0,1
4,0,3,35.0,0,0,8.0500,0,1,0,0,1

In [84]:
X_test.head()

,Pclass,Age,SibSp,Parch,Fare,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S,Y_sur,surv_pred
432,2,42.0,1,0,26.0000,1,0,0,0,1,1,1
672,2,70.0,0,0,10.5000,0,1,0,0,1,0,0
527,1,38.0,0,0,221.7792,0,1,0,0,1,0,1
823,3,27.0,0,1,12.4750,1,0,0,0,1,1,1
665,2,32.0,2,0,73.5000,0,1,0,0,1,0,0

In [116]:
y_pred=lor.predict(X_test)

In [118]:
y_prob_sur = lor.predict_proba(X_test)

In [98]:
X_test.drop(['Y_sur','surv_pred'],axis = 1, inplace =True)

KeyError: "['Y_sur' 'surv_pred'] not found in axis"

In [119]:
X_test["Y_sur"]=y_test

<ipython-input-119-4203cebbe536>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  X_test["Y_sur"]=y_test

In [120]:
X_test["surv_pred"]=y_pred

<ipython-input-120-94f3853e5184>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  X_test["surv_pred"]=y_pred

In [123]:
type(y_prob_sur)

numpy.ndarray

In [124]:
y_prob_sur=pd.DataFrame(y_prob_sur)

In [133]:
y_prob_sur

            0         1
0    0.357537  0.642463
1    0.937479  0.062521
2    0.378179  0.621821
3    0.471342  0.528658
4    0.824853  0.175147
..        ...       ...
262  0.883272  0.116728
263  0.661074  0.338926
264  0.296135  0.703865
265  0.366019  0.633981
266  0.377406  0.622594

[267 rows x 2 columns]

In [130]:
X_test["Prb_0"]= y_prob_sur[0]

<ipython-input-130-b29835d9e57d>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  X_test["Prb_0"]= y_prob_sur[0]

In [131]:
X_test["Prb_1"]= y_prob_sur[1]

<ipython-input-131-a7d96cecf56c>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  X_test["Prb_1"]= y_prob_sur[1]

In [132]:
X_test.head()

,Pclass,Age,SibSp,Parch,Fare,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S,Y_sur,surv_pred,Prb_0,Prb_1
432,2,42.0,1,0,26.0000,1,0,0,0,1,1,1,NaN,NaN
672,2,70.0,0,0,10.5000,0,1,0,0,1,0,0,NaN,NaN
527,1,38.0,0,0,221.7792,0,1,0,0,1,0,1,NaN,NaN
823,3,27.0,0,1,12.4750,1,0,0,0,1,1,1,NaN,NaN
665,2,32.0,2,0,73.5000,0,1,0,0,1,0,0,NaN,NaN

In [73]:
X_test[(X_test["Y_sur"]!=X_test["surv_pred"])].shape

(43, 12)

In [74]:
from sklearn.metrics import accuracy_score

In [92]:
accuracy_score(y_test, y_pred)

0.8389513108614233

In [93]:
from sklearn.metrics import confusion_matrix

In [94]:
confusion_matrix(y_test, y_pred)

array([[141,  20],
       [ 23,  83]], dtype=int64)

In [108]:
from sklearn.naive_bayes import GaussianNB

In [109]:
bnb = GaussianNB()

In [110]:
bnb.fit(X_train, y_train)

GaussianNB()

In [111]:
y_bnb_pred = bnb.predict(X_test)

In [112]:
accuracy_score(y_test,y_bnb_pred)

0.8239700374531835

In [102]:
from sklearn.tree import DecisionTreeClassifier

In [103]:
Dtree = DecisionTreeClassifier()

In [105]:
Dtree.fit(X_train, y_train)

DecisionTreeClassifier()

In [106]:
y_dtree_pred = Dtree.predict(X_test)

In [107]:
accuracy_score(y_test,y_dtree_pred)

0.7827715355805244

In [113]:
from sklearn.metrics import classification_report

In [115]:
print(classification_report(y_test, y_pred))

              precision    recall  f1-score   support

           0       0.86      0.88      0.87       161
           1       0.81      0.78      0.79       106

    accuracy                           0.84       267
   macro avg       0.83      0.83      0.83       267
weighted avg       0.84      0.84      0.84       267